FJavieer/stm32l4-modules/led/src/led.c
/******************************************************************************
 *	led.c								      *
 *	2018/dec/04							      *
 ******************************************************************************/


/******************************************************************************
 ******* headers **************************************************************
 ******************************************************************************/
/* Standard C ----------------------------------------------------------------*/
	#include <stdbool.h>
	#include <stdint.h>

/* Drivers -------------------------------------------------------------------*/
	#include "stm32l4xx_hal.h"

/* libalx --------------------------------------------------------------------*/
/* STM32L4 modules -----------------------------------------------------------*/
	#include "errors.h"

	#include "led.h"


/******************************************************************************
 ******* macros ***************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* enums ****************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* structs **************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* variables ************************************************************
 ******************************************************************************/
/* Global --------------------------------------------------------------------*/
/* Static --------------------------------------------------------------------*/
static	bool	init_pending	= true;


/******************************************************************************
 ******* static functions (declarations) **************************************
 ******************************************************************************/


/******************************************************************************
 ******* global functions *****************************************************
 ******************************************************************************/
	/**
	 * @brief	Init LED in GPIO_PIN_5
	 *		Sets global variable 'error'
	 * @return	None
	 */
void	led_init	(void)
{
	if (init_pending) {
		init_pending	= false;
	} else {
		error	|= ERROR_LED_INIT;
		return;
	}
	
	__HAL_RCC_GPIOA_CLK_ENABLE();

	GPIO_InitTypeDef	gpio_init_values;
	gpio_init_values.Pin		= GPIO_PIN_5;
	gpio_init_values.Mode		= GPIO_MODE_OUTPUT_PP;
	gpio_init_values.Pull		= GPIO_NOPULL;
	gpio_init_values.Speed		= GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &gpio_init_values);

	led_reset();
}

	/**
	 * @brief	LED on
	 *		Sets global variable 'error'
	 * @return	Error
	 */
int	led_set		(void)
{
	if (init_pending) {
		error	|= ERROR_LED_INIT;
		return	ERROR_NOK;
	}

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);

	return	ERROR_OK;
}

	/**
	 * @brief	LED off
	 *		Sets global variable 'error'
	 * @return	Error
	 */
int	led_reset	(void)
{
	if (init_pending) {
		error	|= ERROR_LED_INIT;
		return	ERROR_NOK;
	}

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);

	return	ERROR_OK;
}


/******************************************************************************
 ******* static functions (definitions) ***************************************
 ******************************************************************************/


/******************************************************************************
 ******* end of file **********************************************************
 ******************************************************************************/
